# cython: language_level=3
# !/usr/bin/python
# -*- coding: UTF-8 -*-
# @Date    : 2022-10-25 00:23:45
# @Function: Auto-drawing single line diagram
# @Author  : Luo Xiaochun
# @Email   : luoxiaochun@proton.me
# @version : 1.1.0


ACCOUNTS = {
    '三崇线': {'pwd': '40'},
    'root': {'pwd': '123456'},
    'user': {'pwd': 'user123'},
    'admin': {'pwd': 'admin'},
}

# 程序限制，时间，次数，条数
# sauthority = [1000, 1000, 100]
sauthority = [180000, 180000, 8000]
user = 'Luoyeanling'
# sauthority = [180000, 18000, 1000]

#笔记本
cpufringer = ['BFEBFBFF000306A9PB6T647', 'luoyeanling20020510']

# 办公台式机
# cpufringer = ['BFEBFBFF000306A9BA00710896', 'luoyeanling20020510']


# allow
laureating = '花有重开日，人无少年时！'

company = '弥勒市'
lname = '南大线'
tname = '沙场变'
capacity = 'S11-315'
pole = '9.7'
chosen = ''
checkpole = False

mtname2 = ''
mtname3 = ''

atname1 = ''
atname2 = ''
atname3 = ''

ltname = ''
latname1 = ''
lmtname2 = ''
latname2 = ''

lmtname3 = ''
latname3 = ''

cxpress = []
cypress = []
txpress = []
typress = []

cxrelease = []
cyrelease = []
txrelease = []
tyrelease = []

# 输出列名
COLUMN_NAMES = ["时间", "线路名称", "一次\n短路电流", "故障\n类型", "金属故障\n中心位置", "弧光故障\n中心位置", "电缆故障\n中心位置", '实际\n故障位置', '故障误差',
                '故障信息']

line_names = ['县公司', '厂站', '线路名称', '系统阻抗', '系统阻抗电阻', '系统阻抗电抗', 'CT变比', '第一段线缆型号',
              '第一段线缆长度', '第二段线缆型号', '第二段线缆长度', '线路总长']

lpara_names = ['线路型号', '单位阻抗', '单位电阻', '单位电抗', '计算阻抗', '阻抗角']

faulty_names = ['时间', '县公司', '线路名称', '故障电流Ia', '故障电流Ib', '故障电流Ic',
                '故障线电压', '线路负荷电流', '线路负荷功率因数', '主变负荷电流', '主变负荷功率因数',
                '电站助增机组容量', '主线总长', '故障类型', '一次短路电流', '故障阻抗', '弧光阻抗', '金属故障中心位置', '弧光故障中心位置',
                '电缆故障中心位置', '实际故障位置', '金属故障位置误差', '弧光故障位置误差', '电缆故障位置误差', '故障信息', '金属故障配变坐标1', '弧光故障配变坐标1', '电缆故障配变坐标1',
                '金属故障配变坐标2', '弧光故障配变坐标2', '电缆故障配变坐标2']
faulty_fact = [202005101152374, '测试县', '博鹧线', 63, 0, 0, 10.965, 0, 0.98, 0, 0.98, 0, 30.348, 'd2', 1890, 2.900793651,
               0.2536, 1.629143126, 0.447701291, 99, 2.718, 0.035879032, 0.074808841, 3.172597865, '无',
               '基站专变+路径：14.7.5+距离：1473-41', '交接点虚拟1+路径：14+距离：803-355', '交接点虚拟1+路径：14+距离：803-1657',
               '广场台变+路径：14.6+距离：1373+58', '纪念塔台变+路径：15+距离：875-427', '纪念塔台变+路径：15+距离：875-1729'
               ]

# 故障类型
CATEGORY = ["金属", "弧光", "电缆", "越级", "过负荷"]
faulty_type = '弧光'
zahara = ['南海线', 5.1, 2.9]

lineages = "南海线"
lifetimes = '202002'
holder = "Luoyeanling All Rights Reserved. Copyright © 2022.10"
version = '   Version=1.1.0.α'
pictured = 'dragon.jpg'
picturedleft = 'dragon.jpg'

PRODUCTS = [
    {'时间': '2020-01-01', '线路名称': '南海线', '一次短路电流': 960, '主线总长': 21, '故障类型': '弧光', '金属故障中心位置': 5.2, '弧光故障中心位置': 2.5,
     '电缆故障中心位置': 3.2,
     '实际故障位置': 2.7, '故障误差': 0.05, '故障信息': '外破'}]

PRODUCTSALL = [{'时间': '20200106120634', '县公司': '测试县', '线路名称': '茅白线', '故障电流Ia': 8, '故障电流Ib': 0, '故障电流Ic': 8,
                '故障线电压': 10.504, '线路负荷电流': 5, '线路负荷功率因数': 0.98, '主变负荷电流': 10,
                '主变负荷功率因数': 0.98,
                '电站助增机组容量': 0, '主线总长': 21, '故障类型': 'd2', '一次短路电流': 481.984, '故障阻抗': 10.897, '弧光阻抗': -1,
                '金属故障中心位置': 39.532, '弧光故障中心位置': 15.497,
                '电缆故障中心位置': 9.841, '实际故障位置': 2.718, '金属故障位置误差': 0.1, '弧光故障位置误差': 0.25, '电缆故障位置误差': 0.88,
                '故障信息': '外破', '金属故障配变坐标1': '无', '弧光故障配变坐标1': '无', '电缆故障配变坐标1': '无',
                '金属故障配变坐标2': '无', '弧光故障配变坐标2': '无', '电缆故障配变坐标2': '无'}]

PRODUCTSACT = {'时间': '2020010612061', '县公司': '测试县', '线路名称': '南海线', '故障电流Ia': 9.8, '故障电流Ib': 0, '故障电流Ic': 9.8,
               '故障线电压': 10.504, '线路负荷电流': 5, '线路负荷功率因数': 0.98, '主变负荷电流': 10,
               '主变负荷功率因数': 0.98,
               '电站助增机组容量': 0, '主线总长': 21, '故障类型': 'd2', '一次短路电流': 481.984, '故障阻抗': 10.897, '弧光阻抗': -1,
               '金属故障中心位置': 39.532, '弧光故障中心位置': 15.497,
               '电缆故障中心位置': 9.841, '实际故障位置': 2.718, '金属故障位置误差': 0.1, '弧光故障位置误差': 0.25, '电缆故障位置误差': 0.88,
               '故障信息': '外破', '金属故障配变坐标1': '无', '弧光故障配变坐标1': '无', '电缆故障配变坐标1': '无',
               '金属故障配变坐标2': '无', '弧光故障配变坐标2': '无', '电缆故障配变坐标2': '无'}

transformer = [[200, 16], [100, 10], [80, 5]]
transformermax = [['斯博果1#台变', '100', '9403'], ['斯博果1#台变', '100', '9403'], ['斯博果1#台变', '100', '9403']]
transformermin = [['斯博果1#台变', '100', '9403'], ['斯博果1#台变', '100', '9403'], ['斯博果1#台变', '100', '9403']]
# transience = ['2020030119471', '南海线', float(8.2), float(0), float(0), float(10.4), float(0), float(0.98), float(0),
# float(0), float(2.718), str('无')]
transience = ['2020030119471', '测试县', '南海线', 17.9, 0, 0, 10.3, 0, 0.98, 0, 0.98, 0, 15, 'd2', 460, 18, 4, 0, 0, 0,
              2.718, 0, 0, 0, '越级']

zsys_names = ['时间', '县公司', '线路名称', 'zs', 'rs', 'xs', 'zs_angle', 'zsys_metal',
              'rsys_metal', 'xsys_metal', 'zs_metal_angle', 'zsys_arc', 'rsys_arc', 'xsys_arc',
              'zs_arc_angle', 'zsys_cable', 'rsys_cable', 'xsys_cable', 'zs_cable_angle',
              'Fault_location', 'error_metal', 'error_arc', 'error_cable', 'fault_info',
              'zsys_regulate', 'rsys_regulate', 'xsys_regulate', 'zs_regulate_angle', 'tlocation']

zsys_output = ['20200106120634', '测试县', '南海线', 0.8950975421706843, 0.2981, 0.844, 70.87102740876206, 0.8950975421706843,
               0.2981, 0.844, 70.54688727274944, 0.8950975421706843, 0.2981, 0.844, 70.54688727274944,
               0.8950975421706843, 0.2981, 0.844,
               70.54688727274944, 3.8, 2.97437143317312, 1.0137569231602888, 0.5034292211325503, '外破', 1.36028, 0.20104,
               1.34535, 81.50093, '无+0+0']

# listregulate= ['', '', '', '']
listregulate = ['无', '小夹壁台变', '菌子厂专变', '1#长河坝台变', '基站1#专变']
Line1_para = [{'线路型号': 'LGJ-120', '单位阻抗': 0.436, '单位电阻': 0.263, '单位电抗': 0.348, '计算阻抗': 0.4362, '阻抗角': 52.91998}]

Line2_para = [{'线路型号': 'LGJ-120', '单位阻抗': 0.436, '单位电阻': 0.263, '单位电抗': 0.348, '计算阻抗': 0.4362, '阻抗角': 52.91998}]

Line_info = [
    {'县公司': '测试县', '厂站': '35kV城南变电站', '线路名称': '测试线', '系统阻抗': 2.29060, '系统阻抗电阻': 0.25468, '系统阻抗电抗': 2.27639, 'CT变比': 40,
     '第一段线缆型号': 'LGJ-95', '第一段线缆长度': 11.839, '第二段线缆型号': 'LGJ-70', '第二段线缆长度': 0.000, '线路总长': 11.839, '系统阻抗角': 83.6164}]

Line_parameter = [{'线路型号': 'LGJ-16', '单位阻抗': 2.0121, '单位电阻': 1.969, '单位电抗': 0.414, '计算阻抗': 2.01205, '阻抗角': 11.874},
                  {'线路型号': 'LGJ-25', '单位阻抗': 1.3217, '单位电阻': 1.26, '单位电抗': 0.399, '计算阻抗': 1.32167, '阻抗角': 17.57127},
                  {'线路型号': 'LGJ-35', '单位阻抗': 0.98, '单位电阻': 0.9, '单位电抗': 0.389, '计算阻抗': 0.98047, '阻抗角': 23.37509},
                  {'线路型号': 'LGJ-50', '单位阻抗': 0.735, '单位电阻': 0.63, '单位电抗': 0.379, '计算阻抗': 0.73521, '阻抗角': 31.03061},
                  {'线路型号': 'LGJ-70', '单位阻抗': 0.581, '单位电阻': 0.45, '单位电抗': 0.368, '计算阻抗': 0.58131, '阻抗角': 39.27557},
                  {'线路型号': 'LGJ-95', '单位阻抗': 0.487, '单位电阻': 0.332, '单位电抗': 0.356, '计算阻抗': 0.48679, '阻抗角': 46.99792},
                  {'线路型号': 'LGJ-120', '单位阻抗': 0.436, '单位电阻': 0.263, '单位电抗': 0.348, '计算阻抗': 0.4362, '阻抗角': 52.91998},
                  {'线路型号': 'LGJ-150', '单位阻抗': 0.423, '单位电阻': 0.21, '单位电抗': 0.387, '计算阻抗': 0.44031, '阻抗角': 61.51422},
                  {'线路型号': 'LGJ-185', '单位阻抗': 0.403, '单位电阻': 0.17, '单位电抗': 0.38, '计算阻抗': 0.41629, '阻抗角': 65.89782},
                  {'线路型号': 'LGJ-240', '单位阻抗': 0.381, '单位电阻': 0.131, '单位电抗': 0.372, '计算阻抗': 0.39439, '阻抗角': 70.60032},
                  {'线路型号': 'YJV-35', '单位阻抗': 0.6586705473907271, '单位电阻': 0.654, '单位电抗': 0.0783,
                   '计算阻抗': 0.6586705473907271, '阻抗角': 9.02392},
                  {'线路型号': 'YJV-50', '单位阻抗': 0.4892416682990115, '单位电阻': 0.483, '单位电抗': 0.0779,
                   '计算阻抗': 0.4892416682990115, '阻抗角': 11.70291},
                  {'线路型号': 'YJV-70', '单位阻抗': 0.3423390278656525, '单位电阻': 0.334, '单位电抗': 0.0751,
                   '计算阻抗': 0.3423390278656525, '阻抗角': 15.46501},
                  {'线路型号': 'YJV-95', '单位阻抗': 0.2527596486783442, '单位电阻': 0.241, '单位电抗': 0.0762,
                   '计算阻抗': 0.2527596486783442, '阻抗角': 20.7311},
                  {'线路型号': 'YJV-120', '单位阻抗': 0.20483407919582133, '单位电阻': 0.191, '单位电抗': 0.074,
                   '计算阻抗': 0.20483407919582133, '阻抗角': 25.06094},
                  {'线路型号': 'YJV-150', '单位阻抗': 0.17377931407391387, '单位电阻': 0.157, '单位电抗': 0.0745,
                   '计算阻抗': 0.17377931407391387, '阻抗角': 30.33405},
                  {'线路型号': 'YJV-185', '单位阻抗': 0.14536381943248464, '单位电阻': 0.125, '单位电抗': 0.0742,
                   '计算阻抗': 0.14536381943248464, '阻抗角': 34.90282},
                  {'线路型号': 'YJV-240', '单位阻抗': 0.12241976964526605, '单位电阻': 0.0966, '单位电抗': 0.0752,
                   '计算阻抗': 0.12241976964526605, '阻抗角': 42.44975},
                  {'线路型号': 'YJV-300', '单位阻抗': 0.10820813278122861, '单位电阻': 0.078, '单位电抗': 0.075,
                   '计算阻抗': 0.10820813278122861, '阻抗角': 55.56242},
                  {'线路型号': 'YJV-400', '单位阻抗': 0.10820813278122861, '单位电阻': 0.078, '单位电抗': 0.075,
                   '计算阻抗': 0.10820813278122861, '阻抗角': 66.85902},
                  {'线路型号': 'LGJ-300', '单位阻抗': 0.3798, '单位电阻': 0.105, '单位电抗': 0.365, '计算阻抗': 0.3798, '阻抗角': 73.95106},
                  {'线路型号': 'LGJ-400', '单位阻抗': 0.381, '单位电阻': 0.079, '单位电抗': 0.372, '计算阻抗': 0.3803, '阻抗角': 78.01054},
                  {'线路型号': 'DK水民', '单位阻抗': 0.1154, '单位电阻': 0.001, '单位电抗': 0.1154, '计算阻抗': 0.1154, '阻抗角': 89.50359},
                  {'线路型号': 'LYJV-35', '单位阻抗': 0.7953, '单位电阻': 0.79, '单位电抗': 0.092, '计算阻抗': 0.79534, '阻抗角': 45.00004}]

trans_names = ['capacity', 'u0', 'kt', 'deltat', 'zt', 'rt', 'xt']

trans = [{'capacity': 20, 'u0': 3.7, 'kt': 1.54, 'deltat': 57.0023, 'zt': 185, 'rt': 100.752123498759,
          'xt': 155.158014973416},
         {'capacity': 30, 'u0': 3.7, 'kt': 1.54, 'deltat': 57.0023, 'zt': 123.33, 'rt': 67.1662669789292,
          'xt': 103.435881009035},
         {'capacity': 50, 'u0': 3.7, 'kt': 2.92, 'deltat': 71.0955, 'zt': 74, 'rt': 23.9754608460725,
          'xt': 70.0084086179542},
         {'capacity': 630000, 'u0': 3.7, 'kt': 2.92, 'deltat': 71.0955, 'zt': 158.73, 'rt': 19.028092101214,
          'xt': 155.562078893681},
         {'capacity': 80, 'u0': 3.7, 'kt': 2.92, 'deltat': 71.0955, 'zt': 46.25, 'rt': 14.9846630287953,
          'xt': 43.7552553862214},
         {'capacity': 100, 'u0': 3.8, 'kt': 2.92, 'deltat': 71.0955, 'zt': 38, 'rt': 12.3117231371724,
          'xt': 35.9502638848954},
         {'capacity': 125, 'u0': 3.9, 'kt': 3.6, 'deltat': 74.476, 'zt': 31.2, 'rt': 8.3504633186487,
          'xt': 30.0617657891865},
         {'capacity': 160, 'u0': 3.9, 'kt': 3.6, 'deltat': 74.476, 'zt': 24.38, 'rt': 6.52513768296972,
          'xt': 23.4905721134733},
         {'capacity': 200, 'u0': 4, 'kt': 5.1, 'deltat': 78.9063, 'zt': 20, 'rt': 3.84830416222751,
          'xt': 19.6262720625946},
         {'capacity': 250, 'u0': 4, 'kt': 5.1, 'deltat': 78.9063, 'zt': 16, 'rt': 3.078643329782,
          'xt': 15.7010176500757},
         {'capacity': 315, 'u0': 4, 'kt': 5.1, 'deltat': 78.9063, 'zt': 12.7, 'rt': 2.44367314301447,
          'xt': 12.4626827597476},
         {'capacity': 400, 'u0': 4, 'kt': 5.1, 'deltat': 78.9063, 'zt': 10, 'rt': 1.92415208111375,
          'xt': 9.81313603129732},
         {'capacity': 630, 'u0': 4.5, 'kt': 5.79, 'deltat': 80.2011, 'zt': 7.14, 'rt': 1.2151690646548,
          'xt': 7.03583428914482},
         {'capacity': 800, 'u0': 4.5, 'kt': 5.79, 'deltat': 80.2011, 'zt': 5.63, 'rt': 0.958179528572343,
          'xt': 5.54786373219683},
         {'capacity': 1000, 'u0': 4.5, 'kt': 5.79, 'deltat': 80.2011, 'zt': 4.5, 'rt': 0.765862855874874,
          'xt': 4.434349341898},
         {'capacity': 1250, 'u0': 4.5, 'kt': 7.1, 'deltat': 81.983, 'zt': 3.6, 'rt': 0.502085196270946,
          'xt': 3.56481562716581},
         {'capacity': 1600, 'u0': 4.5, 'kt': 7.1, 'deltat': 81.983, 'zt': 2.81, 'rt': 0.391905389311489,
          'xt': 2.78253664231553},
         {'capacity': 2000, 'u0': 4.5, 'kt': 7.1, 'deltat': 81.983, 'zt': 2.25, 'rt': 0.313803247669341,
          'xt': 2.22800976697863},
         {'capacity': 2500, 'u0': 4.5, 'kt': 10.67, 'deltat': 84.6459, 'zt': 1.8, 'rt': 0.167961554704658,
          'xt': 1.79214645499222},
         {'capacity': 3150, 'u0': 4.5, 'kt': 11.41, 'deltat': 84.9913, 'zt': 1.43, 'rt': 0.12485080571908,
          'xt': 1.4245393207319},
         {'capacity': 4000, 'u0': 4.5, 'kt': 11.41, 'deltat': 84.9913, 'zt': 1.13, 'rt': 0.0986583289947975,
          'xt': 1.12568491778115},
         {'capacity': 5000, 'u0': 4.5, 'kt': 12.14, 'deltat': 85.2911, 'zt': 0.9, 'rt': 0.0738851154718457,
          'xt': 0.896962089339183},
         {'capacity': 6300, 'u0': 4.5, 'kt': 13.55, 'deltat': 85.7793, 'zt': 0.71, 'rt': 0.0522558341469012,
          'xt': 0.708074380130796},
         {'capacity': 8000, 'u0': 4.5, 'kt': 14.23, 'deltat': 85.9803, 'zt': 0.56, 'rt': 0.0392564067515786,
          'xt': 0.558622354125714},
         {'capacity': 12500, 'u0': 4.5, 'kt': 18.6, 'deltat': 86.9226, 'zt': 0.36, 'rt': 0.0193270396171256,
          'xt': 0.359480827777558},
         {'capacity': 16000, 'u0': 4.5, 'kt': 18.6, 'deltat': 86.9226, 'zt': 0.36, 'rt': 0.0193270396171256,
          'xt': 0.359480827777558}]

transz_names = ['tnode', 'company', 'tname', 'tnumber', 'tcapacity', 'lname', 'tpath', 'lpath', 'polepath', 'rline',
                'xline', 'zline', 'deltaline', 'allline_length', 'rt', 'xt', 'zt', 'deltazt', 'ztsecond', 'ldeltaall',
                'ztsecond2', 'ldeltaall2', 'mpolepath', 'xtransformer', 'ytransformer', 'xcapacity',
                'ycapacity', 'longitude', 'latitude', 'altitude', 'brancher', 'other1', 'other2']

buspath_names = ['mode', 'breakerpath', 'busname', 'busnumber', 'bus_station', 'tpath', 'cpath', 'dpath', 'vpath',
                 'lpath', 'gpath', 'rline', 'xline', 'zline', 'deltaline', 'allline_length', 'rt', 'xt', 'zt',
                 'deltazt', 'rbus', 'xbus', 'zbus', 'deltabus', 'longitude', 'latitude']
